rp3595686/ultifeeder_esp32/src/main.cpp
	if (readyState == readyStateDone)
	{
		AHTTPS_LOGDEBUG0(F("\n**************************************\n"));
		AHTTPS_LOGDEBUG1(F("Response Code = "), thisRequest->responseHTTPString());

		if (thisRequest->responseHTTPcode() == 200)
		{
			Serial.println(F("\n**************************************"));
			Serial.println(thisRequest->responseText());
			Serial.println(F("**************************************"));
		}

		thisRequest->setDebug(false);
		readySend[1] = true;
	}
}

void requestCB2(void *optParm, AsyncHTTPSRequest *thisRequest, int readyState)
{
	(void) optParm;

	if (readyState == readyStateDone)
	{
		AHTTPS_LOGDEBUG0(F("\n**************************************\n"));
		AHTTPS_LOGDEBUG1(F("Response Code = "), thisRequest->responseHTTPString());

		if (thisRequest->responseHTTPcode() == 200)
		{
      int pre_feedInterval,pre_readPhInterval,pre_readTempInterval; // save previous values
      String responseText = thisRequest->responseText();
			Serial.println(F("\n**************************************"));
      Serial.println(responseText);
      Serial.println(F("**************************************"));
      if (responseText == "null")
      {}
      StaticJsonDocument<192> jsonResponse;
      auto deserializeError = deserializeJson(jsonResponse, responseText);

      if (deserializeError)
      {
        Serial.println(F("failed"));
      }
      else
      {
        Serial.println(F("OK"));

        if (jsonResponse["readPhInterval"])
        {
          pre_readPhInterval = atoi(readPhInterval); // save previous feedInterval
          int readPhInterval_buffer = jsonResponse["readPhInterval"];
          readPhInterval_buffer = readPhInterval_buffer * 1000; // Change from seconds to miliseconds
          sprintf(readPhInterval, "%d", readPhInterval_buffer);
          Serial.print("Set readPhInterval to ");
          Serial.println(readPhInterval);
        }
        if (jsonResponse["readTempInterval"])
        {
          pre_readTempInterval = atoi(readTempInterval); // save previous feedInterval
          int readTempInterval_buffer = jsonResponse["readTempInterval"];
          readTempInterval_buffer = readTempInterval_buffer * 1000; // Change from seconds to miliseconds
          sprintf(readTempInterval, "%d", readTempInterval_buffer);
          Serial.print("Set readTempInterval to ");
          Serial.println(readTempInterval);
        }
        if (jsonResponse["feedInterval"])
        {
          pre_feedInterval = atoi(feedInterval); // save previous feedInterval
          int feedInterval_buffer = jsonResponse["feedInterval"];
          feedInterval_buffer = feedInterval_buffer * 1000;                    // Change from seconds to miliseconds
          sprintf(feedInterval, "%d", feedInterval_buffer);
          Serial.print("Set feedInterval to ");
          Serial.println(feedInterval);
        }
        if (atoi(readPhInterval) != pre_readPhInterval || atoi(readTempInterval) != pre_readTempInterval || atoi(feedInterval) != pre_feedInterval) // feedInterval changed
          {
            saveFileFSConfigFile(); // save new data to Config File
          }
          jsonResponse.clear();   // release memory used by JsonObject
      }
    }

    thisRequest->setDebug(false);
		readySend[2] = true;
	}
}

String getTime()
{
  if (!getLocalTime(&timeinfo))
  { // if did not get time
    Serial.println("Failed to obtain time");
    return "Failed to obtain time";
  }
  else
  {
    // Serial.println(&timeinfo, "%A, %B %d %Y %H:%M:%S");
    strftime(strTime, 50, "%Y-%m-%d %H:%M:%S", &timeinfo);
    return strTime;
  }
}

void setup()
{
  Serial.begin(115200);

  foodFeed_startMillis = millis();      // initial start time
  readTemp_startMillis = millis(); // initial start time

  pinMode(motor1pin1, OUTPUT);
  pinMode(motor1pin2, OUTPUT);
  pinMode(32, OUTPUT);
  pinMode(LEDR, OUTPUT);
  pinMode(topIRpin, INPUT);
  pinMode(buttomIRpin, INPUT);

  // Controlling spin direction of motors:
  digitalWrite(motor1pin1, HIGH);
  digitalWrite(motor1pin2, LOW);
  analogWrite(32, 255); // ENA pin`

  EEPROM.begin(32); // needed EEPROM.begin to store calibration k in eeprom
  //ph.begin();
  //sensors.begin();
  //ads.setGain(GAIN_ONE);
  //ads.begin();

  // LCD Setup
  phost = &host;
  /* Init HW Hal */
  App_Common_Init(&host);

  
	// put your setup code here, to run once:
  Serial.begin(115200);

  while (!Serial && millis() < 5000);

  delay(200);

  Serial.print(F("\nStarting Ultifeeder using "));
  Serial.print(FS_Name);
  Serial.print(F(" on "));
  Serial.println(ARDUINO_BOARD);
  Serial.println(ESP_ASYNC_WIFIMANAGER_VERSION);
  Serial.println(ASYNC_HTTPS_REQUEST_GENERIC_VERSION);
  Serial.println(ESP_DOUBLE_RESET_DETECTOR_VERSION);

#if defined(ESP_ASYNC_WIFIMANAGER_VERSION_INT)

  if (ESP_ASYNC_WIFIMANAGER_VERSION_INT < ESP_ASYNC_WIFIMANAGER_VERSION_MIN)
  {
    Serial.print(F("Warning. Must use this example on Version later than : "));
    Serial.println(ESP_ASYNC_WIFIMANAGER_VERSION_MIN_TARGET);
  }

#endif

#if defined(ASYNC_HTTPS_REQUEST_GENERIC_VERSION_MIN)

  if (ASYNC_HTTPS_REQUEST_GENERIC_VERSION_INT < ASYNC_HTTPS_REQUEST_GENERIC_VERSION_MIN)
  {
    Serial.print(F("Warning. Must use this example on Version equal or later than : "));
    Serial.println(ASYNC_HTTPS_REQUEST_GENERIC_VERSION_MIN_TARGET);
  }

#endif

#ifdef ESP32

  if (!FileFS.begin(true))
#else
  if (!FileFS.begin())
#endif
  {
#ifdef ESP8266
    FileFS.format();
#endif

    Serial.println(F("SPIFFS/LittleFS failed! Already tried formatting."));

    if (!FileFS.begin())
    {
      // prevents debug info from the library to hide err message.
      delay(100);

#if USE_LITTLEFS
      Serial.println(F("LittleFS failed!. Please use SPIFFS or EEPROM. Stay forever"));
#else
      Serial.println(F("SPIFFS failed!. Please use LittleFS or EEPROM. Stay forever"));
#endif

      while (true)
      {
        delay(1);
      }
    }
  }

  drd = new DoubleResetDetector(DRD_TIMEOUT, DRD_ADDRESS);

  loadFileFSConfigFile();

